site/2017-05-28-Ryo_Fukui.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://notes.neeasade.netrss.xml"
      title="RSS feed for https://notes.neeasade.net"/>
<title>Ryo Fukui albums: -</title>

    <link href="https://cdnjs.cloudflare.com/ajax/libs/normalize/8.0.0/normalize.css" rel="stylesheet">
    <link rel="stylesheet" href="https://unpkg.com/sakura.css/css/sakura.css" type="text/css">
    </head>
<body>
<div id="preamble" class="status">
</div>
<div id="content">
<div class="post-date">28 May 2017</div><h1 class="post-title"><a href="2017-05-28-Ryo_Fukui.html">Ryo Fukui albums: -</a></h1>
<ul class="org-ul">
<li>Scenery release: 1976 link:</li>
</ul>

<p>
<a href="https://www.youtube.com/watch?v=Hrr3dp7zRQY">https://www.youtube.com/watch?v=Hrr3dp7zRQY</a> -
</p>
<ul class="org-ul">
<li>Mellow Dream</li>
</ul>
<p>
release: 1977 link: <a href="https://www.youtube.com/watch?v=tFxbMrA6Sfo">https://www.youtube.com/watch?v=tFxbMrA6Sfo</a> -
</p>

<ul class="org-ul">
<li>In New York release: 1999 link:</li>
</ul>
<p>
<a href="https://www.youtube.com/watch?v=PV8tQmtG3dE">https://www.youtube.com/watch?v=PV8tQmtG3dE</a> -
</p>

<ul class="org-ul">
<li>[[]]A Letter from Slowboat release: 2015 <a href="https://www.youtube.com/watch?v=kVV%5C_z1lBNLo">https://www.youtube.com/watch?v=kVV\_z1lBNLo</a></li>
</ul>

<p>
Ryo Fukui was a Japanese jazz pianist. He learned to play the piano at
22 and 6 years later released his debut album <i>Scenery</i> in 1976. He
passed away in 2016. Today, you can find most of his released work
online. One album that has escaped is <i>My Favourite Tune/(1995). A
youtuber with the handle /Marcel The Drunkard</i> had a Japanese contact
that evidently recorded many of the original bootlegs of Fukui's
work(<a href="https://www.reddit.com/r/translator/comments/5n8ckh/japanese_english_comment_about_music/?utm_name=frontpage">link</a>),
but he did not have a copy.
</p>

<p>
Here are youtube links to his(often with other artists) albums at this
time:
</p>

<p>
{% for album in page.albums %} - <a href="%7B%7Balbum.link%7D%7D">{{
album.title }}</a> ({{album.release}}) {% endfor %}
</p>
</div>
<div id="postamble" class="status"></div>
</body>
</html>
